
    [
        {
            "title": "Spaghetti bolognese",
            "photo": "assets/images/spaghetti.jpg",
            "portion": "4",
            "duration": "1h:30m",
            "ingredients": "-2 tbsp olive oil\n\n- 400g/14oz beef mince\n\n- 1 onion, diced\n\n- 2 garlic cloves, chopped\n\n- 100g/3½oz carrot, grated\n\n- 2 x 400g tin chopped tomatoes\n\n- 400ml/14fl oz stock (made from stock cube. Ideally beef, but any will do)\n\n- 400g/14oz dried spaghetti\n\n- salt and pepper",
            "method": "1- Heat a large saucepan over a medium heat. Add a tablespoon of olive oil and once hot add the beef mince and a pinch of salt and pepper. Cook the mince until well browned over a medium-high heat (be careful not to burn the mince. It just needs to be a dark brown colour). Once browned, transfer the mince to a bowl and set aside.\n\n2- Add another tablespoon of oil to the saucepan you browned the mince in and turn the heat to medium. Add the onions and a pinch of salt and fry gently for 5-6 minutes, or until softened and translucent. Add the garlic and cook for another 2 minutes. Add the grated carrot then pour the mince and any juices in the bowl back into the saucepan.\n\n3- Add the tomatoes to the pan and stir well to mix. Pour in the stock, bring to a simmer and then reduce the temperature to simmer gently for 45 minutes, or until the sauce is thick and rich. Taste and adjust the seasoning as necessary.\n\n4- When ready to cook the spaghetti, heat a large saucepan of water and add a pinch of salt. Cook according to the packet instructions. Once the spaghetti is cooked through, drain and add to the pan with the bolognese sauce. Mix well and serve."
        },
        {
            "title": "Everyday roast chicken",
            "photo": "assets/images/chicken.jpg",
            "portion": "2-3",
            "duration": "2h",
            "ingredients": "- 1 small, free-range roasting chicken\n\n- 75ml/3fl oz olive oil\n\n- 4 cloves of garlic, squashed\n\n- 1 large lemon\n\n- 6 sprigs thyme\n\n- salt and freshly ground black pepper",
            "method": "1- Preheat the oven to 220C/200C Fan/Gas 8.\n\n2- Place the chicken onto a chopping board and cut in half down the backbone using a large and very sharp cooks’ knife. Flatten the chicken as much as you can buy pressing down with the palm of your hand.\n\n3- Pour the olive oil into a mixing bowl large enough to take the chicken, add the squashed garlic cloves, the juice from the lemon and then the squeezed lemon shells. Put in the sprigs of thyme, a good seasoning of salt and black pepper, then turn the chicken over in the oil. (If you have the time, you can leave the chicken like this for an hour or so in the fridge.)\n\n4- Place the chicken in a roasting tin, skin-side up. Roast for about 30 minutes or until the skin is golden and the bird cooked right through."
        },
        {
            "title": "Firecracker prawns with stir-fried greens",
            "photo": "assets/images/firecracker.jpg",
            "portion": "2",
            "duration": "30m",
            "ingredients": "- 1 tsp fennel seeds\n\n- 2 tsp cumin seeds\n\n- 4 spring onions, thinly sliced\n\n- 2 red chillies, finely chopped (remove seeds for less heat)\n\n- 3 tbsp finely chopped fresh coriander leaves and stalks\n\n- 2 limes, juice only\n\n- 2 tbsp oyster sauce\n\n- ¼ tsp ground star anise\n\n- 1 tbsp cider vinegar\n\n- 1 tbsp dark soy sauce\n\n- 600g/1lb 5oz raw tiger prawns, peeled, defrosted if frozen\n\n\n- FOR THE STIR-FRIED GREEENS\n\n\n- 1 tsp light olive oil\n\n- 3 pak choi, roughly chopped\n\n- 1 tsp grated fresh root ginger\n\n- 1 tbsp light soy sauce\n\n- ¼ tsp toasted sesame oil " ,
            "method": "1- Toast the fennel and cumin seeds in a small frying pan for 1–2 minutes, or until fragrant. Crush with a pestle and mortar and tip into a mixing bowl. Add the spring onions, chillies, coriander, lime juice, oyster sauce, star anise, vinegar and soy sauce. Stir in the prawns and marinate for 10 minutes.\n\n2- Preheat the grill to its highest setting.\n\n3- Spread the prawns on a grill rack and grill for 3–4 minutes, or until pink and cooked through. Keep warm.\n\n4- To make the stir-fried greens, heat the oil in a wide, non-stick frying pan over a high heat. Add the pak choi, ginger and soy sauce and cook for 4–5 minutes, or until just wilted. Stir in the sesame oil.\n\n5- Serve the greens with the prawns immediately."
        },
        {
            "title": "Feijoada",
            "photo": "assets/images/feijoada.jpg",
            "portion": "6-8",
            "duration": "overnight",
            "ingredients": "- 1kg/2lb 4oz dried black beans\n\n- 4 tbsp olive oil\n\n- 500g/1lb 2oz dry-smoked pork ribs, fat trimmed, cut into individual ribs\n\n- 1kg/2lb 4oz unsmoked pork ribs, fat trimmed, cut into individual ribs\n\n- 1 large onion, roughly chopped\n\n- 1 head garlic, cloves finely chopped\n\n- 500g/1lb 2oz smoked bacon, cut into medium-sized pieces\n\n- 500g/1lb 2oz pork belly, cut into medium-sized chunks\n\n- 200g/7oz smoked pork sausage, cut into medium-sized chunks\n\n- salt and freshly ground black pepper\n\n- 2 tbsp dried chilli flakes (optional)",
            "method": "1- Soak the black beans in 2 litres/3½ pints of cold water overnight.\n\n2- When the beans have soaked, heat half of the oil in a lidded frying pan (large enough to fit all the ribs in at once) over a medium heat.\n\n3- Season the smoked and unsmoked pork ribs all over with salt and freshly ground black pepper. Fry the ribs for 4-5 minutes on each side, or until browned on both sides.\n\n4- Add the onion and garlic and continue to fry for a further 2-3 minutes, stirring well, until softened.\n\n5- Add 250ml/9fl oz water and bring it to a simmer, then cover the frying pan with the lid and cook for 18-20 minutes, topping up the pan with water as necessary if the liquid evaporates too quickly. Transfer the pan contents to a large casserole and set aside.\n\n6- Wipe the frying pan clean with kitchen paper, then heat the remaining oil over a medium heat. Fry the bacon, pork belly and sausage, in batches, until browned all over (do not overcrowd the pan). Transfer the browned meat to the casserole.\n\n7- Add the soaked black beans and the soaking liquid to the casserole and stir well. Bring the mixture to the boil, then reduce the heat until the mixture is simmering gently. Simmer, half-covered, for about 2½ hours, topping up the casserole with water every so often to prevent it from drying out. The feijoada is ready when the ribs are tender and the meat is almost falling off the bone.\n\n8- Just before serving, season the feijoada with salt and freshly ground black pepper, if necessary, and with chill flakes, if desired."
        },
        {
            "title": "Chicken and chorizo empanadas",
            "photo": "assets/images/empanadas.jpg",
            "portion": "10",
            "duration": "3h:30m",
            "ingredients": "- FOR THE FILLING\n\n- 4 chicken thighs, on the bone and skin on\n\n- 1 tbsp olive oil\n\n- 1 onion, finely chopped\n\n- 1 garlic clove, crushed\n\n- 100g/3½oz British-style chorizo, finely diced\n\n- ½ tsp cumin seeds\n\n- 50g/1¾oz raisins\n\n- salt and pepper\n\n\n- FOR THE EMPANADA DOUGH\n\n\n- 150g/5½oz unsalted butter\n\n- 300g/10½oz plain flour\n\n- large pinch salt\n\n- 1 free-range egg, lightly beaten\n\n- beaten egg, to finish",
            "method": "1- Heat the oven to 180C/350F/Gas 4.\n\n2- For the filling, put the chicken thighs in a small roasting dish, season well all over with salt and pepper and roast for about 45 minutes, or until cooked through. Set aside to cool a little.\n\n3- Meanwhile, make the pastry. Melt the butter and leave it to cool slightly. Put the flour in a large bowl and mix in the salt. Pour in the butter and egg. Start mixing, adding 3-5 tablespoons of water as you go, until you have a soft dough. Turn this out onto a clean work surface and knead it gently for a couple of minutes, or until smooth. Return the dough to its bowl, cover and set aside to rest while you prepare the filling.\n\n4- To finish the filling, heat the oil in a frying pan over a medium-low heat. Add the onion and cook for 10–12 minutes, or until soft.\n\n5- Add the garlic, chorizo, cumin seeds and raisins. Cook over a medium heat for 5–8 minutes, stirring often, until the chorizo is cooked. Remove from the heat.\n\n6- Once the chicken thighs are cool enough to handle, remove the skin. Pull all the meat from the bones and chop it roughly. Add to the chorizo mixture. Taste and add salt and pepper if needed (the chorizo is already quite salty), then leave to cool completely.\n\n7- Turn the oven to 200C/400F/Gas 6 and line a large baking tray with baking parchment.\n\n8- Lightly flour the work surface and roll out the dough to a thickness of 3-4mm. Use a 12cm/4½in cutter or a small bowl to cut out 10 discs. You will probably need to re-roll the offcuts once to get this many. Divide the filling between the discs. Dampen the edges of the dough with water then fold over one half of each disc to make a semicircular parcel. Press the edges together firmly then crimp or press the edges with a fork.\n\n9- Put the empanadas on the baking tray and brush with beaten egg. Bake for 15–20 minutes, or until golden-brown. Eat them warm, on their own or with a chilli sauce."
        },
        {
            "title": "Crème brûlée",
            "photo": "assets/images/brule.jpg",
            "portion": "6",
            "duration": "30m",
            "ingredients": "\n\n- 500ml/18fl oz double cream\n\n- 1 vanilla pod\n\n- 100g/4oz caster sugar (plus extra for the topping)\n\n- 6 free-range egg yolks",
            "method": "1- Preheat the oven to 150C/300F/Gas 2.\n\n2- Pour the cream into a saucepan. Split the vanilla pod lengthways and scrape the seeds into the cream.\n\n3- Chop the empty pod into small pieces, and add them to the cream.\n\n4- Bring the cream to boiling point, then reduce the heat and simmer gently for five minutes.\n\n5- Meanwhile, in a separate bowl, beat the sugar and egg yolks together in a large heatproof bowl until pale and fluffy.\n\n6- Bring the cream back to boiling point. Pour it over the egg mixture, whisking continuously until thickened - this indicates that the eggs have begun to cook slightly.\n\n7- Strain the mixture through a fine sieve into a large jug, and then use this to fill six ramekins to about two-thirds full.\n\n8- Place the ramekins into a large roasting tray and pour in enough hot water to come halfway up their outsides. (This is called a bain-marie.)\n\n9- Place the bain-marie onto the centre shelf of the oven and bake for 40-45 minutes, or until the custards are just set but still a bit wobbly in the middle.\n\n10- Remove the ramekins from the water and set aside to cool to room temperature. Chill until needed.\n\n11- When ready to serve, sprinkle one level teaspoon of caster sugar evenly over the surface of each crème brûlée, then caramelise with a chefs' blow-torch.\n\n12- Set aside to cool for a couple of minutes, then serve."
        },
        {
            "title": "Chocolate brownies",
            "photo": "assets/images/brownie.jpg",
            "portion": "20",
            "duration": "30m",
            "ingredients": "- 225g/8oz butter\n\n- 450g/1lb caster sugar\n\n- 140g/5oz dark chocolate, broken into pieces\n\n- 5 free-range medium eggs\n\n- 110g/4oz plain flour\n\n- 55g/2oz cocoa powder",
            "method": "1- Heat the oven to 190C/170C Fan/Gas 5. Line a 20x30cm/8x12in baking tin with baking paper.\n\n2- Gently melt the butter and the sugar together in a large pan. Once melted, take off the heat and add the chocolate. Stir until melted.\n\n3- Beat in the eggs, then stir in the rest of the ingredients.\n\n4- Pour into the prepared tin and bake for 30–40 minutes, or until the top of the brownie is firm but the inside still feels soft.\n\n5- Take out of the oven and cool in the tin. Cut into 5cm/2in squares when cool."
        }

    ]

